# [Pandas10분 완성](https://pandas.pydata.org/pandas-docs/stable/10min.html)

이 소개서는 주로 신규 사용자를 대상으로 한 판다에 대한 간략한 소개입니다. 더 복잡한 방법은 [Cookbook](https://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook) 에서 볼 수 있습니다.

일반적으로 다음과 같이 가져옵니다.

In [7]:
import pandas as pd

In [8]:
import numpy as np

In [9]:
import matplotlib.pyplot as plt

시리즈와 같은 것으로 바뀔 수 있는 객체의 dict로 구성된 dataframe을 만듭니다.

In [10]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

 DataFrame 결과의 행은 다양한 데이터타입(dtypes)으로 구성됩니다.

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

IPython을 이용하고 계시다면, 열 이름에 대한(공용속성은 물론) tap완성 기능(tap completion)이 자동으로 활성화됩니다. 다음은 완성될 속성에 대한 부분집합(subset)입니다.

In [ ]:
df2 <tap을 누르세요.>

In [ ]:
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.clip_lower
df2.align              df2.clip_upper
df2.all                df2.columns
df2.any                df2.combine
df2.append             df2.combine_first
df2.apply              df2.compound
df2.applymap           df2.consolidate
df2.D

보시다시피, A,B,C그리고 D 열이 탭 자동완성기능으로 실행됩니다. 물론 E도 있습니다. 나머지 속성들은 간결하게 잘라버렸습니다.


# Viewing Data
1조: 처음~22번

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [ ]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

**Viewing Data 데이터 확인하기**

In [ ]:
데이터프레임의 맨 윗 줄과 마지막 줄을 확인하고 싶을 때 .head()와 .tail()을 입력합니다. 

괄호()안에는 숫자가 들어갈 수도 있고 안 들어갈 수도 있습니다. 
숫자가 들어간다면, 윗/마지막 줄의 특정 줄을 불러올 수 있습니다. 
숫자가 들어가지 않다면, 기본값인 5로 처리됩니다.

(예시) 
df.tail(3) - 끝에서 마지막 3줄을 불러옴
df.tail() - 끝에서 마지막 5줄 불러옴

In [10]:
df.head()

                   A         B         C         D
2013-01-01 -0.527986  1.901471 -1.128302 -1.216338
2013-01-02  0.724692  0.611865  0.075657 -0.535417
2013-01-03  0.424716  1.335635  0.479678 -0.596492
2013-01-04 -1.186081 -1.060936 -0.824235 -1.408271
2013-01-05 -0.614861  0.020317 -1.184843 -0.273189

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.186081 -1.060936 -0.824235 -1.408271
2013-01-05 -0.614861  0.020317 -1.184843 -0.273189
2013-01-06 -1.704603 -0.193390  0.731213 -0.232786

인덱스(Index), 행 (Column) 그리고 데이터에 대한 세부 정보를 보려면 .index, .columns, .values를 입력합니다.

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[-0.52798622,  1.90147125, -1.12830182, -1.21633802],
       [ 0.72469156,  0.61186508,  0.07565709, -0.53541671],
       [ 0.42471602,  1.33563542,  0.47967792, -0.5964917 ],
       [-1.18608132, -1.06093594, -0.82423465, -1.40827078],
       [-0.61486088,  0.0203175 , -1.18484299, -0.27318902],
       [-1.70460278, -0.19339006,  0.73121257, -0.23278589]])

데이터의 대략적인 통계적 정보를 보려면 describe()를 입력합니다.

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.480687  0.435827 -0.308472 -0.710415
std    0.926119  1.076812  0.843307  0.491093
min   -1.704603 -1.060936 -1.184843 -1.408271
25%   -1.043276 -0.139963 -1.052285 -1.061376
50%   -0.571424  0.316091 -0.374289 -0.565954
75%    0.186540  1.154693  0.378673 -0.338746
max    0.724692  1.901471  0.731213 -0.232786

In [ ]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

# 객체생성

[데이터 구조 소개 섹션](https://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro)을 참조하십시오.

판다스는 값을 가지고 있는 리스트를 통해 시리즈를 만들고, 인덱스를 기본값으로 불러올 것입니다.

In [5]:
s = pd.Series([1,3,5,np.nan,6,8])

In [6]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

[DataFrame](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html#pandas.DataFrame) datetime 인덱스와 레이블이있는 열이있는 NumPy 배열을 전달하여 a 만들기 :

In [8]:
dates = pd.date_range('20130101', periods=6)

In [9]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2013-01-01  1.458820  0.247541 -0.779845  2.175895
2013-01-02 -0.680268 -0.682247  1.789324  0.352487
2013-01-03  0.454372  1.870514  0.090400 -0.708950
2013-01-04 -0.188282 -0.573742 -0.249154 -0.481982
2013-01-05 -1.068930  0.663761 -1.268271 -1.136568
2013-01-06 -0.596239 -1.835190  0.576963 -1.661536

# Object Creation
# Viewing Data

In [7]:
import pandas as pd

In [8]:
import numpy as np

데이터를 전치한다(행과 열을 바꾼다). 시리즈와 같은 것으로 바뀔 수 있는 객체의 dict로 구성된 dataframe을 만듭니다.

In [10]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

 DataFrame 결과의 행은 다양한 데이터타입(dtypes)으로 구성됩니다.

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

IPython을 이용하고 계시다면, 열 이름에 대한(공용속성은 물론) tap완성 기능(tap completion)이 자동으로 활성화됩니다. 다음은 완성될 속성에 대한 부분집합(subset)입니다.

In [ ]:
df2 <tap을 누르세요.>

In [ ]:
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.clip_lower
df2.align              df2.clip_upper
df2.all                df2.columns
df2.any                df2.combine
df2.append             df2.combine_first
df2.apply              df2.compound
df2.applymap           df2.consolidate
df2.D

보시다시피, A,B,C그리고 D 열이 탭 자동완성기능으로 실행됩니다. 물론 E도 있습니다. 나머지 속성들은 간결하게 잘라버렸습니다.

In [5]:
import pandas as pd
import numpy as np
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.038505 -1.167585 -1.336534  0.089177
2013-01-02 -0.721064  1.160822 -0.291106  0.782514
2013-01-03 -0.735768 -0.966903  0.203481 -0.630711
2013-01-04  0.468277  1.145166 -2.236549 -1.558934
2013-01-05  1.097254  0.105656 -0.341843 -0.198379
2013-01-06 -0.634519  1.712039 -0.237186 -0.739356

## Apply

함수를 데이터에 적용합니다.

In [6]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.038505 -1.167585 -1.336534  0.089177
2013-01-02 -0.759569 -0.006763 -1.627640  0.871690
2013-01-03 -1.495336 -0.973666 -1.424159  0.240980
2013-01-04 -1.027059  0.171500 -3.660708 -1.317955
2013-01-05  0.070194  0.277157 -4.002552 -1.516334
2013-01-06 -0.564324  1.989195 -4.239737 -2.255690

In [7]:
df.apply(lambda x: x.max() - x.min())

A    1.833021
B    2.879624
C    2.440030
D    2.341448
dtype: float64

## Histogramming
See more at Histogramming and Discretization.

# Merge

## Concat

Pandas는 join/merge 와 같은 병합작업의 경우 'concat()' 을 통해<br>
Series, DataFrame,Panel 객체를 index와 relational algebra과 결합할 수 있게해준다.

Merging 섹션을 보자 [pandas.Panel — pandas 0.23.3 documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Panel.html)

'concat()'으로 Pandas 객체를 concatenating 하자

In [8]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [9]:
In [69]: s

0    1
1    1
2    4
3    5
4    5
5    4
6    0
7    5
8    2
9    3
dtype: int32

In [10]:
In [70]: s.value_counts()

5    3
4    2
1    2
3    1
2    1
0    1
dtype: int64

In [0]:
# 데이터 실행을 위한 코드로, Merge 하면서 삭제 필요 (다음주 B조 여러분 부탁드립니다~)

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

dates = pd.date_range('20130101', periods = 6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

# Selection (선택)

주석(Note) : 선택과 설정을 위한 Python, Numpy의 표준화된 표현들이 직관적이며, 코드 작성을 위한 양방향 작업에 유용하지만 우리는 Pandas에 최적화된 데이터 접근 방법인 .at, .iat, .loc 및 .iloc. 을 추천합니다. 

[데이터 인덱싱 및 선택](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) 문서와 [다중 인덱싱 / 심화 인덱싱](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced) 문서를 확인하십시오.

## Getting (데이터 얻기)

df.A 와 동일한 Series를 생성하는 단일 열을 선택합니다.

In [3]:
df['A']

2013-01-01    0.476135
2013-01-02   -0.261414
2013-01-03   -0.507001
2013-01-04   -0.768574
2013-01-05    0.637249
2013-01-06    2.599747
Freq: D, Name: A, dtype: float64

행을 분할하는 [] 를 통해 선택합니다

In [4]:
df[0:3]

                   A         B         C         D
2013-01-01  0.476135  0.508006 -0.321132 -0.641527
2013-01-02 -0.261414 -0.791119  0.970945 -0.361053
2013-01-03 -0.507001  0.687692  0.800694  0.039465

In [5]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.261414 -0.791119  0.970945 -0.361053
2013-01-03 -0.507001  0.687692  0.800694  0.039465
2013-01-04 -0.768574 -1.544202  1.387927 -0.142048

## Selection by Label (Label 을 통한 선택)

[Label을 통한 선택](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-label)에서 더 많은 내용을 확인하세요.

라벨을 사용하여 횡단면을 얻는 방법입니다.

In [6]:
df.loc[dates[0]]

A    0.476135
B    0.508006
C   -0.321132
D   -0.641527
Name: 2013-01-01 00:00:00, dtype: float64

라벨을 사용하여 여러 축(의 데이터)을 얻는 방법입니다.

In [7]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.476135  0.508006
2013-01-02 -0.261414 -0.791119
2013-01-03 -0.507001  0.687692
2013-01-04 -0.768574 -1.544202
2013-01-05  0.637249 -0.535187
2013-01-06  2.599747  0.364275

양쪽 종단점을 포함한 라벨 슬라이싱을 봅시다.

In [8]:
df.loc['20130102':'20130104', ['A','B']]

                   A         B
2013-01-02 -0.261414 -0.791119
2013-01-03 -0.507001  0.687692
2013-01-04 -0.768574 -1.544202

반환되는 객체의 크기를 줄입니다.

In [9]:
df.loc['20130102',['A','B']]

A   -0.261414
B   -0.791119
Name: 2013-01-02 00:00:00, dtype: float64

스칼라 값을 얻습니다.

In [10]:
df.loc[dates[0],'A']

0.4761354437722567

스칼라 값을 더 빠르게 구하는 방법입니다. (앞선 method와 동일합니다)

In [11]:
df.at[dates[0],'A']

0.4761354437722567

## 위치로 선택하기

자세한 내용은 [위치로 선택하기](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer)를 참고해주세요.

넘겨받은 정수의 위치로 선택하기:

# Merge

## Concat

Pandas는 join/merge 와 같은 병합작업의 경우 'concat()' 을 통해<br>
Series, DataFrame,Panel 객체를 index와 relational algebra과 결합할 수 있게해준다.

Merging 섹션을 보자 [pandas.Panel — pandas 0.23.3 documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Panel.html)

'concat()'으로 Pandas 객체를 concatenating 하자

In [21]:
df.iloc[3]

A    0.203785
B    1.125125
C   -0.865039
D    0.523641
Name: 2013-01-04 00:00:00, dtype: float64

넘파이/파이썬 작동 방식처럼 정수로 표기된 슬라이스로 선택하기:

In [22]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.203785  1.125125
2013-01-05  1.985457 -0.982028

넘파이/파이썬 작동 방식처럼 정수로 표기된 위치값을 기반으로 선택하기:

In [23]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.159695 -0.166089
2013-01-03  0.910357 -0.676971
2013-01-05  1.985457 -0.031075

행만 나누고 싶을 때:

In [24]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.159695  1.028619 -0.166089 -1.535081
2013-01-03  0.910357  0.970961 -0.676971  0.261557

열만 나누고 싶을 때:

In [25]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.472455  1.216767
2013-01-02  1.028619 -0.166089
2013-01-03  0.970961 -0.676971
2013-01-04  1.125125 -0.865039
2013-01-05 -0.982028 -0.031075
2013-01-06 -0.370556 -0.510562

값만 얻고 싶을 때:

In [26]:
df.iloc[1,1]

1.0286191331647372

스칼라 값을 빨리 얻고 싶을 때(위 방식과 동일):

In [27]:
df.iat[1,1]

1.0286191331647372

## Boolean Indexing

### <부울 인덱싱>

#### 선택한 데이터에 단일 열의 값을 사용한다.

In [74]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.509296  0.949764  0.465564  1.168993
2013-01-03  1.362507 -0.410838  0.274134 -0.666104
2013-01-04  1.397707 -1.159303 -1.615495  0.694031
2013-01-06  1.627127  0.207076 -0.576249  0.255399

#### 부울 조건에 충족되는 데이터프레임에서 변수를 선택한다.

In [75]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.509296  0.949764  0.465564  1.168993
2013-01-02       NaN  1.362515  0.269928  0.226156
2013-01-03  1.362507       NaN  0.274134       NaN
2013-01-04  1.397707       NaN       NaN  0.694031
2013-01-05       NaN       NaN  1.594030       NaN
2013-01-06  1.627127  0.207076       NaN  0.255399

#### 필터링 방법인 [isin()](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html#pandas.Series.isin)을 사용한다.

In [76]:
df2 = df.copy()

In [77]:
df2['E'] = ['one', 'one','two','three','four','three']

In [78]:
df2

                   A         B         C         D      E
2013-01-01  1.509296  0.949764  0.465564  1.168993    one
2013-01-02 -0.086348  1.362515  0.269928  0.226156    one
2013-01-03  1.362507 -0.410838  0.274134 -0.666104    two
2013-01-04  1.397707 -1.159303 -1.615495  0.694031  three
2013-01-05 -0.358856 -0.788163  1.594030 -0.279220   four
2013-01-06  1.627127  0.207076 -0.576249  0.255399  three

In [79]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.362507 -0.410838  0.274134 -0.666104   two
2013-01-05 -0.358856 -0.788163  1.594030 -0.279220  four

In [7]:
df

          0         1         2         3
0 -1.370113  1.306357  0.805064 -0.262886
1  0.059452  0.921803 -0.264351 -0.479659
2 -0.149725  0.429804 -1.730625 -0.585599
3  2.396598 -1.112323  0.831191  0.017524
4 -0.939851  0.398300 -1.503311  1.185740
5 -0.777850 -0.061262 -1.752889  1.381885
6  0.573826  0.704169 -1.114609 -0.916635
7 -0.311905  0.587430  0.069653 -0.247175
8  0.149070 -1.614154 -0.119656  0.534045
9  0.599226 -0.656358 -0.316240  0.335043

In [11]:
pieces = [df[:3], df[3:7], df[7:]]

In [7]:
df

          0         1         2         3
0 -1.370113  1.306357  0.805064 -0.262886
1  0.059452  0.921803 -0.264351 -0.479659
2 -0.149725  0.429804 -1.730625 -0.585599
3  2.396598 -1.112323  0.831191  0.017524
4 -0.939851  0.398300 -1.503311  1.185740
5 -0.777850 -0.061262 -1.752889  1.381885
6  0.573826  0.704169 -1.114609 -0.916635
7 -0.311905  0.587430  0.069653 -0.247175
8  0.149070 -1.614154 -0.119656  0.534045
9  0.599226 -0.656358 -0.316240  0.335043

In [11]:
pieces = [df[:3], df[3:7], df[7:]]

## Join
SQL 방식으로 merge합니다. [Database style joining](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join) 섹션을 참고하세요.

In [5]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [12]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

          0         1         2         3
0 -1.370113  1.306357  0.805064 -0.262886
1  0.059452  0.921803 -0.264351 -0.479659
2 -0.149725  0.429804 -1.730625 -0.585599
3  2.396598 -1.112323  0.831191  0.017524
4 -0.939851  0.398300 -1.503311  1.185740
5 -0.777850 -0.061262 -1.752889  1.381885
6  0.573826  0.704169 -1.114609 -0.916635
7 -0.311905  0.587430  0.069653 -0.247175
8  0.149070 -1.614154 -0.119656  0.534045
9  0.599226 -0.656358 -0.316240  0.335043

데이터프레임의 맨 윗 줄과 마지막 줄을 확인하고 싶을 때 .head()와 .tail()을 입력합니다. 

괄호()안에는 숫자가 들어갈 수도 있고 안 들어갈 수도 있습니다. 
숫자가 들어간다면, 윗/마지막 줄의 특정 줄을 불러올 수 있습니다. 
숫자가 들어가지 않다면, 기본값인 5로 처리됩니다.

(예시) 
df.tail(3) - 끝에서 마지막 3줄을 불러옴
df.tail() - 끝에서 마지막 5줄 불러옴

In [5]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

이와 관련된 다른 예제는 아래와 같습니다.

In [10]:
left

                   A         B         C         D
2013-01-01 -0.527986  1.901471 -1.128302 -1.216338
2013-01-02  0.724692  0.611865  0.075657 -0.535417
2013-01-03  0.424716  1.335635  0.479678 -0.596492
2013-01-04 -1.186081 -1.060936 -0.824235 -1.408271
2013-01-05 -0.614861  0.020317 -1.184843 -0.273189

## Append

데이터프레임에 하나, 혹은 여러 개의 행을 추가합니다. [Appending](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation) 섹션을 참조하시기 바랍니다.

In [3]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.186081 -1.060936 -0.824235 -1.408271
2013-01-05 -0.614861  0.020317 -1.184843 -0.273189
2013-01-06 -1.704603 -0.193390  0.731213 -0.232786

인덱스(Index), 행 (Column) 그리고 데이터에 대한 세부 정보를 보려면 .index, .columns, .values를 입력합니다.

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [5]:
s = df.iloc[3]

In [12]:
df.values

array([[-0.52798622,  1.90147125, -1.12830182, -1.21633802],
       [ 0.72469156,  0.61186508,  0.07565709, -0.53541671],
       [ 0.42471602,  1.33563542,  0.47967792, -0.5964917 ],
       [-1.18608132, -1.06093594, -0.82423465, -1.40827078],
       [-0.61486088,  0.0203175 , -1.18484299, -0.27318902],
       [-1.70460278, -0.19339006,  0.73121257, -0.23278589]])

데이터의 대략적인 통계적 정보를 보려면 describe()를 입력합니다.

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.480687  0.435827 -0.308472 -0.710415
std    0.926119  1.076812  0.843307  0.491093
min   -1.704603 -1.060936 -1.184843 -1.408271
25%   -1.043276 -0.139963 -1.052285 -1.061376
50%   -0.571424  0.316091 -0.374289 -0.565954
75%    0.186540  1.154693  0.378673 -0.338746
max    0.724692  1.901471  0.731213 -0.232786

In [ ]:
축(axis)별로 정렬한다.

In [9]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.127969  0.031798  0.108164  0.518786
2013-01-02 -1.114345  1.040367 -0.464647  1.049498
2013-01-03 -0.705101 -1.041051 -2.689833 -1.661886
2013-01-04 -0.708731  0.319365 -0.789118 -0.543158
2013-01-05 -0.771842 -1.526564 -1.483834  0.463727
2013-01-06 -0.003326 -0.415173  0.142561  0.589408

In [ ]:
값(values)으로 정렬한다.

In [10]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -1.661886 -2.689833 -1.041051 -0.705101
2013-01-05  0.463727 -1.483834 -1.526564 -0.771842
2013-01-04 -0.543158 -0.789118  0.319365 -0.708731
2013-01-02  1.049498 -0.464647  1.040367 -1.114345
2013-01-01  0.518786  0.108164  0.031798  0.127969
2013-01-06  0.589408  0.142561 -0.415173 -0.003326

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

# 객체생성

[데이터 구조 소개 섹션](https://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro)을 참조하십시오.

판다스는 값을 가지고 있는 리스트를 통해 시리즈를 만들고, 인덱스를 기본값으로 불러올 것입니다.

In [5]:
s = pd.Series([1,3,5,np.nan,6,8])

In [6]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

# Getting Data In/Out

## CSV

## HDF5

## Excel

# Gotchas

작업을 수행하려고 시도하면 다음과 같은 예외 상황을 볼 수도 있습니다 :

In [2]:
    if pd.Series([False, True, False]):
    print("I was true")

IndentationError: expected an indented block (<ipython-input-2-9074a2390e8e>, line 2)

설명 및 수행 할 작업은 [비교](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-compare)를 참조하십시오.

[Gotchas](https://pandas.pydata.org/pandas-docs/stable/gotchas.html#gotchas)도 참조하십시오.

8조: 141~끝

In [8]:
dates = pd.date_range('20130101', periods=6)

In [9]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2013-01-01  1.458820  0.247541 -0.779845  2.175895
2013-01-02 -0.680268 -0.682247  1.789324  0.352487
2013-01-03  0.454372  1.870514  0.090400 -0.708950
2013-01-04 -0.188282 -0.573742 -0.249154 -0.481982
2013-01-05 -1.068930  0.663761 -1.268271 -1.136568
2013-01-06 -0.596239 -1.835190  0.576963 -1.661536